#include <iostream>

using namespace std;

int main()
{
    /* 二维数组定义方式 */
    // 1.数据类型 数组名[行数][列数];
    // 2.数据类型 数组名[行数][列数] = {{数据1,数据2},{数据3,数据4}};
    // 3.数据类型 数组名[行数][列数] = {数据1,数据2,数据3,数据4};
    // 4.数据类型 数组名[][列数] = {数据1,数据2,数据3,数据4};;

    // 方式1
    int arr1[2][3];
    arr1[0][0] = 1;
    arr1[0][1] = 2;
    arr1[0][2] = 3;
    arr1[1][0] = 4;
    arr1[1][1] = 5;
    arr1[1][2] = 6;
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            cout << arr1[i][j] << endl;
        }
    }
    cout << "=================================================================================" << endl;
    // 方式2
    // 数据类型 数组名[][] = {{},{}}
    int arr2[2][3] = {{1, 2, 3}, {4, 5, 6}};
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            cout << arr2[i][j] << " ";
        }
        cout << endl;
    }
    cout << "=================================================================================" << endl;
    // 方式3
    // 数据类型 数组名[][] = {}
    int arr3[2][3] = {1, 2, 3, 4, 5, 6};
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            cout << arr2[i][j] << " ";
        }
        cout << endl;
    }
    cout << "=================================================================================" << endl;
    // 方式4
    // 数据类型 数组名[][] = {}
    int arr4[][3] = {1, 2, 3, 4, 5, 6};
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            cout << arr2[i][j] << " ";
        }
        cout << endl;
    }
    /* 数组名 */
    // 查看内存空间 sizeof(arr)整个内存空间 sizeof(arr[])一行所占内存空间 sizeof(arr[][])一个元素所占内存空间
    // 查看首地址
    cout << "=================================================================================" << endl;
    cout << "该数组一共有" << sizeof(arr4) / sizeof(arr4[0][0]) << " 个元素。" << endl;
    cout << "该数组一共有" << sizeof(arr4) / sizeof(arr4[0]) << " 行" << endl;
    cout << "该数组一共有" << sizeof(arr4[0]) / sizeof(arr4[0][0]) << " 列" << endl;
    cout << "该数组的首地址为 " << arr4 << endl;
    cout << "该数组的第一行首地址为 " << &arr4[0] << endl;
    cout << "该数组的第二行首地址为 " << &arr4[1] << endl;
    cout << "该数组的第一个元素地址为 " << &arr4[0][0] << endl;
    cout << "该数组的二行第一个元素地址为 " << &arr4[1][0] << endl;
}