#include <iostream>

using namespace std;

int main(){
    /* for 循环语句 */
    // for (起始表达式；条件表达式；末尾循环体){循环语句}
    // 打印0~9
    for (int i = 0;i < 10;i++){
        cout << i << endl;
    }

    cout << "=========================水仙花数==============================================" << endl;

    /* for实现水仙花 */
    for (int a = 1;a < 10;a++){
        for (int b = 0;b < 10;b++){
            for (int c = 0;c < 10;c++){
                if (a*a*a + b*b*b + c*c*c == a*100 +b*10+c){
                    cout << a*100 +b*10+c << endl;
                }
            }
        }
    }

    cout << "=========================敲桌子==============================================" << endl;

    /* 敲桌子 */
    // 先输出0~99
    // 从这些数字中找出这些特殊数字，改为输出“敲桌子”
    // 特殊数字为带有7或者7的倍数
    // 使用for循环实现
    
    cout << "**************************方法二*******************************************" << endl;

    // 方法一 一般for循环
    for (int i = 0;i < 100; i++){
        int a = i % 10;
        int b = i / 10 % 10;
        int c = i % 7;
        if ((a == 7 || b == 7 || c == 0) && i != 0){
            cout << "敲桌子" << endl;
        }
        else{
            cout << i << endl;
        }
    }

    cout << "**************************方法二*******************************************" << endl;

    // 方法二 for循环嵌套
    for (int a = 0;a <= 9;a++){
        for (int b = 0;b <= 9;b++){
            int c = a*10+b;
            if ((a == 7 || b == 7 || c % 7 == 0) && c != 0){
                cout << "敲桌子" << endl;
            }
            else{
                cout << c << endl;
            }
        }
    }
}